#include <iostream>
#include <limits>
using namespace std;
/*
Вариант 9.
Написать программу, которая рассчитает площадь треугольника по известному углу a,
 сторонам A и B. Считается, что треугольник существует.

        А - сторона
        В - сторона
        а - угол
        S - площадь
                         S = (a * b * sinα) / 2 - фрмуля
                        треугольник заведомо существует*

*/
int main()
{
    int A;
    std::cin >> A;

    int B;
    std::cin >> B;

    int a;
    std::cin >> a;







    return 0;
}